src/TextDiffusion/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

w 1.5;
h 0.3;
d 0.1;

nw 300;
nh 60;
nd 1;

vertices
(
    (0 0 0)
    ($w 0 0)
    ($w $h 0)
    (0 $h 0)
    (0 0 $d)
    ($w 0 $d)
    ($w $h $d)
    (0 $h $d)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) ($nw $nh $nd) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type wall;
        faces
        (
            (4 7 3 0)
        );
    }
    right
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    top
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
