src/TextDiffusion/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type noSlip;
        //type zeroGradient;
    }
    right
    {
        //type zeroGradient;
        type noSlip;
    }
    top
    {
        type fixedValue;
        //type zeroGradient;
        value uniform (1e-4 0 0);
    }
    bottom
    {
        type noSlip;
        //type zeroGradient;
    }
    frontAndBack
    {
        type empty;
    }
}


// ************************************************************************* //
