src/TextDiffusion/case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type zeroGradient;
        //type zeroGradient;
        value uniform 300;
    }
    right
    {
        //type zeroGradient;
        type zeroGradient       ;
        value uniform 300;
    }
    top
    {
        type zeroGradient;
        //type zeroGradient;
        value uniform 300;
    }
    bottom
    {
        type zeroGradient;
        //type zeroGradient;
        value uniform 300;
    }
    frontAndBack
    {
        type empty;
    }
}


// ************************************************************************* //
