src/TextDiffusion/case/0/T
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions  [0 0 0 1 0 0 0];
internalField  uniform 300;


boundaryField
{
    left
    {
        //type fixedValue;
        type zeroGradient;
        value uniform 300;
    }
    right
    {
        type zeroGradient;
        //type fixedValue;
        //value uniform 300;
    }
    top
    {
        //type fixedValue;
        type zeroGradient;
        value uniform 300;
    }
    bottom
    {
        //type fixedValue;
        type zeroGradient;
        value uniform 300;
    }
    frontAndBack
    {
        type empty;
    }
}
